Repository: mishrafabric/cmux
Catalog: webviews/src/pages/diff/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, vi, zh_hans, zh_hant

# diffViewer.additions
source: Additions
ar: الإضافات
bs: Dodavanja
da: Tilføjelser
de: Hinzufügungen
es: Adiciones
fr: Ajouts
it: Aggiunte
ja: 追加
km: ការបន្ថែម
ko: 추가
nb: Tillegg
pl: Dodania
pt_br: Adições
ru: Добавления
th: การเพิ่ม
tr: Eklemeler
uk: Додавання
vi: Thêm mới
zh_hans: 新增
zh_hant: 新增

# diffViewer.bars
source: Bars
ar: الأشرطة
bs: Trake
da: Bjælker
de: Balken
es: Barras
fr: Barres
it: Barre
ja: バー
km: របារ
ko: 막대
nb: Streker
pl: Paski
pt_br: Barras
ru: Полосы
th: แถบ
tr: Çubuklar
uk: Смуги
vi: Thanh
zh_hans: 条形
zh_hant: 長條

# diffViewer.binaryFile
source: Binary file
ar: ملف ثنائي
bs: Binarna datoteka
da: Binær fil
de: Binärdatei
es: archivo binario
fr: Fichier binaire
it: File binario
ja: バイナリファイル
km: ឯកសារ binary
ko: 바이너리 파일
nb: Binærfil
pl: Plik binarny
pt_br: Arquivo binário
ru: Бинарный файл
th: ไฟล์ไบนารี
tr: İkili dosya
uk: Бінарний файл
vi: Tệp nhị phân
zh_hans: 二进制文件
zh_hant: 二進位檔案

# diffViewer.branchBase
source: Branch base
ar: أساس الفرع
bs: Osnovna grana
da: Basisgren
de: Branch-Basis
es: Base de la rama
fr: Base de la branche
it: Ramo di base
ja: 比較元ブランチ
km: សាខាមូលដ្ឋាន
ko: 브랜치 베이스
nb: Basisgren
pl: Gałąź bazowa
ru: Базовая ветка
th: สาขาฐาน
tr: Temel dal
uk: Базова гілка
vi: Cơ sở nhánh
zh_hans: 分支基线
zh_hant: 分支基底

# diffViewer.branchPickerBasePrefix
source: Base:
ar: الأساس:
bs: Osnova:
da: Basis:
de: Basis:
ja: 比較元:
km: មូលដ្ឋាន៖
ko: 베이스:
nb: Basis:
pl: Baza:
ru: База:
th: ฐาน:
tr: Temel:
uk: База:
vi: Cơ sở:
zh_hans: 基线：
zh_hant: 基底：

# diffViewer.branchPickerComparing
source: Comparing {head} against {base}
ar: مقارنة {head} مع {base}
bs: Poređenje {head} sa {base}
da: Sammenligner {head} med {base}
de: Vergleich von {head} mit {base}
es: Comparando {head} con {base}
fr: Comparaison de {head} avec {base}
it: Confronto di {head} con {base}
ja: {head} を {base} と比較
km: កំពុងប្រៀបធៀប {head} ជាមួយ {base}
ko: {base}와(과) {head} 비교 중
nb: Sammenligner {head} med {base}
pl: Porównywanie {head} z {base}
pt_br: Comparando {head} com {base}
ru: Сравнение {head} с {base}
th: กำลังเปรียบเทียบ {head} กับ {base}
tr: {head}, {base} ile karşılaştırılıyor
uk: Порівняння {head} з {base}
vi: So sánh {head} với {base}
zh_hans: 正在比较 {head} 与 {base}
zh_hant: 正在比較 {head} 與 {base}

# diffViewer.branchPickerCurrent
source: current
ar: الحالي
bs: trenutna
da: aktuel
de: aktuell
es: actual
fr: actuelle
it: corrente
ja: 現在
km: បច្ចុប្បន្ន
ko: 현재
nb: gjeldende
pl: bieżąca
pt_br: atual
ru: текущая
th: ปัจจุบัน
tr: geçerli
uk: поточна
vi: hiện tại
zh_hans: 当前
zh_hant: 目前

# diffViewer.branchPickerFilterPlaceholder
source: Search branches
ar: تصفية الفروع
bs: Pretraži grane
da: Søg efter grene
de: Branches filtern
es: Filtrar ramas
fr: Filtrer les branches
it: Cerca rami
ja: ブランチを検索
km: ស្វែងរកសាខា
ko: 브랜치 필터링
nb: Søk etter grener
pl: Szukaj gałęzi
pt_br: Buscar branches
ru: Поиск веток
th: ค้นหาสาขา
tr: Dalları ara
uk: Пошук гілок
vi: Lọc branch
zh_hans: 筛选分支
zh_hant: 篩選分支

# diffViewer.branchPickerGenerateFailed
source: Could not generate the diff. Choose a branch to retry.
ar: تعذّر إنشاء الفرق. اختر فرعًا لإعادة المحاولة.
bs: Nije moguće generisati razliku. Odaberite granu da pokušate ponovo.
da: Kunne ikke generere diffen. Vælg en gren for at prøve igen.
de: Der Diff konnte nicht erstellt werden. Wähle einen Branch, um es erneut zu versuchen.
es: No se pudo generar la diferencia. Elige una rama para volver a intentarlo.
fr: Impossible de générer le diff. Choisissez une branche pour réessayer.
it: Impossibile generare il diff. Scegli un branch per riprovare.
ja: 差分を生成できませんでした。ブランチを選び直してください。
km: មិនអាចបង្កើតភាពខុសគ្នាបានទេ។ ជ្រើសរើសសាខាដើម្បីព្យាយាមម្តងទៀត។
ko: 차이를 생성할 수 없습니다. 다시 시도할 브랜치를 선택하세요.
nb: Kunne ikke generere diffen. Velg en gren for å prøve igjen.
pl: Nie udało się wygenerować różnic. Wybierz gałąź, aby spróbować ponownie.
pt_br: Não foi possível gerar o diff. Escolha uma branch para tentar novamente.
ru: Не удалось создать diff. Выберите ветку, чтобы повторить попытку.
th: สร้าง diff ไม่สำเร็จ เลือกสาขาเพื่อลองอีกครั้ง
tr: Fark oluşturulamadı. Yeniden denemek için bir dal seçin.
uk: Не вдалося створити diff. Виберіть гілку, щоб повторити спробу.
vi: Không thể tạo diff. Chọn một branch để thử lại.
zh_hans: 无法生成差异。请选择一个分支重试。
zh_hant: 無法產生差異。請選擇分支後重試。

# diffViewer.branchPickerGenerating
source: Generating diff against {ref}...
ar: جاري إنشاء الفروقات (diff) بالمقارنة مع {ref}...
bs: Generisanje razlike prema {ref}...
da: Genererer diff mod {ref}...
de: Diff gegen {ref} wird generiert...
es: Generando diferencias con {ref}...
fr: Génération du diff par rapport à {ref}...
it: Generazione delle differenze rispetto a {ref}...
ja: {ref} との差分を生成中...
km: កំពុងបង្កើតភាពខុសគ្នាជាមួយ {ref}...
ko: {ref}에 대한 변경 사항 생성 중...
nb: Genererer diff mot {ref}...
pl: Generowanie różnic względem {ref}...
pt_br: Gerando diferenças em relação a {ref}...
ru: Создание различий относительно {ref}...
th: กำลังสร้างความแตกต่างกับ {ref}...
tr: {ref} ile fark oluşturuluyor...
uk: Створення відмінностей відносно {ref}...
vi: Đang tạo diff với {ref}...
zh_hans: 正在生成与 {ref} 的差异...
zh_hant: 正在產生相對於 {ref} 的差異...

# diffViewer.branchPickerGroupBranches
source: Branches
ar: الفروع
bs: Grane
da: Grene
es: Ramas
it: Rami
ja: ブランチ
km: សាខា
ko: 브랜치
nb: Grener
pl: Gałęzie
ru: Ветки
th: สาขา
tr: Dallar
uk: Гілки
vi: Nhánh
zh_hans: 分支
zh_hant: 分支

# diffViewer.branchPickerGroupRecent
source: Recent
ar: مؤخرًا
bs: Nedavno
da: Seneste
de: Jüngste
es: Reciente
fr: Récent
it: Recenti
ja: 最近
km: ថ្មីៗ
ko: 최근의
nb: Nylige
pl: Ostatnie
pt_br: Recentes
ru: Недавние
th: ล่าสุด
tr: Son kullanılanlar
uk: Нещодавні
vi: Gần đây
zh_hans: 最近
zh_hant: 最近的

# diffViewer.branchPickerGroupRemotes
source: Remotes
ar: الفروع البعيدة
bs: Udaljeni repozitoriji
da: Fjernlagre
es: Remotos
fr: Branches distantes
it: Repository remoti
ja: リモート
km: ឃ្លាំងពីចម្ងាយ
ko: 원격
nb: Eksterne arkiver
pl: Zdalne repozytoria
pt_br: Repositórios remotos
ru: Удалённые репозитории
th: ที่เก็บระยะไกล
tr: Uzak depolar
uk: Віддалені репозиторії
vi: Kho từ xa
zh_hans: 远程
zh_hant: 遠端

# diffViewer.branchPickerGroupSuggested
source: Suggested
ar: مقترح
bs: Predloženo
da: Foreslåede
de: Empfohlen
es: sugerido
fr: Suggéré
it: Suggeriti
ja: 候補
km: បានណែនាំ
ko: 제안
nb: Foreslåtte
pl: Sugerowane
pt_br: Sugeridos
ru: Предлагаемые
th: แนะนำ
tr: Önerilenler
uk: Пропоновані
vi: Gợi ý
zh_hans: 建议
zh_hant: 建議

# diffViewer.branchPickerGroupWorktrees
source: Worktrees
ar: شجرات العمل
bs: Radna stabla
da: Arbejdstræer
es: Árboles de trabajo
fr: Arbres de travail
it: Alberi di lavoro
ja: ワークツリー
km: មែកធាងការងារ
ko: 작업 트리
nb: Arbeidstrær
pl: Drzewa robocze
pt_br: Árvores de trabalho
ru: Рабочие деревья
th: ต้นไม้การทำงาน
tr: Çalışma ağaçları
uk: Робочі дерева
vi: Cây làm việc
zh_hans: 工作树
zh_hant: 工作樹

# diffViewer.branchPickerLoadFailed
source: Could not load branches.
ar: تعذر تحميل الفروع.
bs: Nije moguće učitati grane.
da: Kunne ikke indlæse grene.
de: Branches konnten nicht geladen werden.
es: No se pudieron cargar las ramas.
fr: Impossible de charger les branches.
it: Impossibile caricare i rami.
ja: ブランチを読み込めませんでした。
km: មិនអាចផ្ទុកសាខាបានទេ។
ko: 브랜치를 불러올 수 없습니다.
nb: Kunne ikke laste inn grener.
pl: Nie udało się wczytać gałęzi.
pt_br: Não foi possível carregar as branches.
ru: Не удалось загрузить ветки.
th: โหลดสาขาไม่ได้
tr: Dallar yüklenemedi.
uk: Не вдалося завантажити гілки.
vi: Không thể tải danh sách branch.
zh_hans: 无法加载分支。
zh_hant: 無法載入分支。

# diffViewer.branchPickerLoading
source: Loading branches...
ar: جاري تحميل الفروع...
bs: Učitavanje grana...
da: Indlæser grene...
de: Branches werden geladen...
es: Cargando ramas...
fr: Chargement des branches...
it: Caricamento dei rami...
ja: ブランチを読み込み中...
km: កំពុងផ្ទុកសាខា...
ko: 브랜치 불러오는 중...
nb: Laster inn grener...
pl: Wczytywanie gałęzi...
pt_br: Carregando branches...
ru: Загрузка веток...
th: กำลังโหลดสาขา...
tr: Dallar yükleniyor...
uk: Завантаження гілок...
vi: Đang tải branch...
zh_hans: 正在加载分支...
zh_hant: 正在載入分支...

# diffViewer.branchPickerMore
source: {count} more, type to filter
ar: أكثر بـ {count}، اكتب للتصفية
bs: Još {count}, unesite tekst za filtriranje
da: {count} flere, skriv for at filtrere
de: {count} weitere, zum Filtern tippen
es: {count} más, escribe para filtrar
fr: {count} de plus, saisissez pour filtrer
it: Altri {count}, digita per filtrare
ja: ほか {count} 件。入力して絞り込み
km: {count} ទៀត វាយដើម្បីត្រង
ko: {count}개 더 있음, 필터링하려면 입력하세요
nb: {count} flere, skriv for å filtrere
pl: Jeszcze {count}, wpisz tekst, aby filtrować
pt_br: Mais {count}, digite para filtrar
ru: Ещё {count}, введите текст для фильтрации
th: อีก {count} รายการ พิมพ์เพื่อกรอง
tr: {count} tane daha, filtrelemek için yazın
uk: Ще {count}, введіть текст для фільтрування
vi: {count} mục nữa, nhập để lọc
zh_hans: 还有 {count} 项，输入以筛选
zh_hant: 還有 {count} 個，輸入以進行篩選

# diffViewer.branchPickerNoMatches
source: No matching branches
ar: لا توجد فروع مطابقة
bs: Nema odgovarajućih grana
da: Ingen matchende grene
de: Keine übereinstimmenden Branches
es: No hay ramas coincidentes
fr: Aucune branche correspondante
it: Nessun ramo corrispondente
ja: 一致するブランチがありません
km: គ្មានសាខាដែលត្រូវគ្នា
ko: 일치하는 브랜치 없음
nb: Ingen samsvarende grener
pl: Brak pasujących gałęzi
pt_br: Nenhuma branch correspondente
ru: Нет подходящих веток
th: ไม่มีสาขาที่ตรงกัน
tr: Eşleşen dal yok
uk: Немає відповідних гілок
vi: Không tìm thấy branch phù hợp
zh_hans: 没有匹配的分支
zh_hant: 無相符的分支

# diffViewer.branchPickerOpen
source: Change diff base
ar: تغيير أساس الفروقات
bs: Promijeni osnovu razlike
da: Skift diff-basis
de: Diff-Basis ändern
es: Cambiar base de diferencias
fr: Modifier la base du diff
it: Cambia base del confronto
ja: 比較元を変更
km: ប្ដូរមូលដ្ឋានភាពខុសគ្នា
ko: 변경 사항 베이스 수정
nb: Endre diff-basis
pl: Zmień bazę porównania
pt_br: Alterar base da comparação
ru: Изменить базу сравнения
th: เปลี่ยนฐานการเปรียบเทียบ
tr: Fark temelini değiştir
uk: Змінити базу порівняння
vi: Đổi base diff
zh_hans: 更改差异基线
zh_hant: 變更差異基底

# diffViewer.branchPickerReasonDefault
source: default branch
ar: الفرع الافتراضي
bs: zadana grana
da: standardgren
de: Standardbranch
es: rama predeterminada
fr: branche par défaut
it: ramo predefinito
ja: 既定のブランチ
km: សាខាលំនាំដើម
ko: 기본 브랜치
nb: standardgren
pl: domyślna gałąź
pt_br: branch padrão
ru: ветка по умолчанию
th: สาขาเริ่มต้น
tr: varsayılan dal
uk: типова гілка
vi: nhánh mặc định
zh_hans: 默认分支
zh_hant: 預設分支

# diffViewer.branchPickerReasonManual
source: chosen
ar: محدد
bs: odabrano
da: valgt
de: ausgewählt
es: elegida
fr: choisie
it: selezionato
ja: 選択済み
km: បានជ្រើស
ko: 선택됨
nb: valgt
pl: wybrana
pt_br: selecionado
ru: выбрана
th: เลือกแล้ว
tr: seçili
uk: вибрано
vi: đã chọn
zh_hans: 已选择
zh_hant: 已選取

# diffViewer.branchPickerUseRaw
source: Use "{ref}" (raw)
ar: استخدام "{ref}" (خام)
bs: Koristi "{ref}" (izvorno)
da: Brug "{ref}" (rå)
de: "{ref}" (raw) verwenden
es: Usar "{ref}" (sin procesar)
fr: Utiliser « {ref} » (brut)
it: Usa "{ref}" (grezzo)
ja: 「{ref}」をそのまま使用
km: ប្រើ "{ref}" (ដើម)
ko: "{ref}"(raw) 사용
nb: Bruk "{ref}" (rå)
pl: Użyj "{ref}" (bez zmian)
pt_br: Usar "{ref}" (bruto)
ru: Использовать «{ref}» (как есть)
th: ใช้ "{ref}" (ดิบ)
tr: "{ref}" kullan (ham)
uk: Використати «{ref}» (як є)
vi: Dùng "{ref}" (raw)
zh_hans: 使用“{ref}”（原始）
zh_hant: 使用 "{ref}" (原始)

# diffViewer.changedFiles
source: Changed files
ar: الملفات المعدلة
bs: Izmijenjene datoteke
da: Ændrede filer
de: Geänderte Dateien
es: Archivos modificados
fr: Fichiers modifiés
it: File modificati
ja: 変更されたファイル
km: ឯកសារដែលបានផ្លាស់ប្តូរ
ko: 변경된 파일
nb: Endrede filer
pl: Zmienione pliki
pt_br: Arquivos alterados
ru: Изменённые файлы
th: ไฟล์ที่เปลี่ยนแปลง
tr: Değişen dosyalar
uk: Змінені файли
vi: Tệp đã thay đổi
zh_hans: 已更改文件
zh_hant: 變更的檔案

# diffViewer.changedSinceViewed
source: Changed since viewed
ar: تغيّر منذ المشاهدة
bs: Izmijenjeno nakon pregleda
da: Ændret siden set
de: Seit dem Ansehen geändert
es: Cambiado desde que se vio
fr: Modifié depuis la consultation
it: Modificato dopo la visione
ja: 確認後に変更あり
km: បានផ្លាស់ប្ដូរបន្ទាប់ពីបានមើល
ko: 확인 후 변경됨
nb: Endret siden sett
pl: Zmieniono od obejrzenia
pt_br: Alterado desde que foi visto
ru: Изменено после просмотра
th: เปลี่ยนแปลงหลังจากดูแล้ว
tr: Görüldükten sonra değişti
uk: Змінено після перегляду
vi: Đã thay đổi sau khi xem
zh_hans: 查看后已更改
zh_hant: 檢視後已變更

# diffViewer.classic
source: Classic
ar: كلاسيكي
bs: Klasični
da: Klassisk
de: Klassisch
es: Clásico
fr: Classique
it: Classico
ja: クラシック
km: បុរាណ
ko: 클래식
nb: Klassisk
pl: Klasyczny
pt_br: Clássico
ru: Классический
th: คลาสสิก
tr: Klasik
uk: Класичний
vi: Cổ điển
zh_hans: 经典
zh_hant: 經典

# diffViewer.clearFileFilter
source: Clear filter
ar: مسح التصفية
bs: Očisti filter
da: Ryd filter
de: Filter zurücksetzen
es: Borrar filtro
fr: Effacer le filtre
it: Cancella filtro
ja: フィルタをクリア
km: សម្អាតតម្រង
ko: 필터 지우기
nb: Fjern filter
pl: Wyczyść filtr
pt_br: Limpar filtro
ru: Сбросить фильтр
th: ล้างตัวกรอง
tr: Filtreyi temizle
uk: Скинути фільтр
vi: Xóa bộ lọc
zh_hans: 清除筛选
zh_hant: 清除篩選

# diffViewer.collapseAllDiffs
source: Collapse all diffs
ar: طي جميع الفروقات
bs: Sažmi sve diffove
da: Skjul alle diffs
de: Alle Diffs einklappen
es: Contraer todas las diferencias
fr: Réduire tous les diffs
it: Comprimi tutti i diff
ja: すべての差分を折りたたむ
km: បង្រួម diff ទាំងអស់
ko: 모든 변경 사항 접기
nb: Skjul alle diffs
pl: Zwiń wszystkie diffy
pt_br: Recolher todos os diffs
ru: Свернуть все diff
th: ยุบ diff ทั้งหมด
tr: Tüm diff’leri daralt
uk: Згорнути всі diff
vi: Thu gọn tất cả diff
zh_hans: 折叠所有差异
zh_hant: 折疊所有差異

# diffViewer.collapseFile
source: Collapse {file}
ar: طي {file}
bs: Sažmi {file}
da: Fold {file} sammen
de: {file} einklappen
es: Contraer {file}
fr: Réduire {file}
it: Comprimi {file}
ja: {file} を折りたたむ
km: បង្រួម {file}
ko: {file} 접기
nb: Slå sammen {file}
pl: Zwiń {file}
pt_br: Recolher {file}
ru: Свернуть {file}
th: ยุบ {file}
tr: {file} daralt
uk: Згорнути {file}
vi: Thu gọn {file}
zh_hans: 折叠 {file}
zh_hant: 收合 {file}

# diffViewer.collapseUnchangedContext
source: Collapse unchanged context
ar: طي السياق غير المعدل
bs: Sažmi nepromijenjeni kontekst
da: Fold uændret kontekst sammen
de: Unveränderten Kontext einklappen
es: Contraer contexto sin cambios
fr: Réduire le contexte non modifié
it: Comprimi contesto invariato
ja: 変更のない行を折りたたむ
km: បង្រួមបរិបទដែលមិនផ្លាស់ប្ដូរ
ko: 변경되지 않은 컨텍스트 접기
nb: Slå sammen uendret kontekst
pl: Zwiń niezmieniony kontekst
pt_br: Recolher contexto inalterado
ru: Свернуть неизменённый контекст
th: ยุบบริบทที่ไม่เปลี่ยนแปลง
tr: Değişmeyen bağlamı daralt
uk: Згорнути незмінений контекст
vi: Thu gọn ngữ cảnh không thay đổi
zh_hans: 折叠未更改的上下文
zh_hant: 折疊未變更的內容

# diffViewer.commit
source: Commit
ar: الإيداع
ja: コミット
ko: 커밋
ru: Коммит
th: คอมมิต
uk: Коміт
zh_hans: 提交
zh_hant: 提交

# diffViewer.copiedFilePath
source: Copied the file path
ar: تم نسخ مسار الملف
bs: Putanja datoteke kopirana
da: Filstien er kopieret
de: Dateipfad kopiert
es: Ruta del archivo copiada
fr: Chemin du fichier copié
it: Percorso del file copiato
ja: ファイルのパスをコピーしました
km: បានចម្លងផ្លូវឯកសារ
ko: 파일 경로를 복사했습니다
nb: Filbanen er kopiert
pl: Skopiowano ścieżkę pliku
pt_br: Caminho do arquivo copiado
ru: Путь к файлу скопирован
th: คัดลอกเส้นทางไฟล์แล้ว
tr: Dosya yolu kopyalandı
uk: Шлях до файлу скопійовано
vi: Đã sao chép đường dẫn tệp
zh_hans: 已复制文件路径
zh_hant: 已複製檔案路徑

# diffViewer.copiedGitApplyCommand
source: Copied git apply command
ar: تم نسخ أمر git apply
bs: Komanda git apply je kopirana
da: git apply-kommando kopieret
de: Befehl "git apply" kopiert
es: Comando git apply copiado
fr: Commande git apply copiée
it: Comando git apply copiato
ja: git apply コマンドをコピーしました
km: បានចម្លងពាក្យបញ្ជា git apply
ko: git apply 명령어 복사됨
nb: git apply-kommando kopiert
pl: Skopiowano polecenie git apply
pt_br: Comando git apply copiado
ru: Команда git apply скопирована
th: คัดลอกคำสั่ง git apply แล้ว
tr: git apply komutu kopyalandı
uk: Команду git apply скопійовано
vi: Đã sao chép lệnh git apply
zh_hans: 已复制 git apply 命令
zh_hant: 已複製 git apply 指令

# diffViewer.copyFailedFilePath
source: Could not copy the file path.
ar: تعذر نسخ مسار الملف.
bs: Nije moguće kopirati putanju datoteke.
da: Kunne ikke kopiere filstien.
de: Dateipfad konnte nicht kopiert werden.
es: No se pudo copiar la ruta del archivo.
fr: Impossible de copier le chemin du fichier.
it: Impossibile copiare il percorso del file.
ja: ファイルのパスをコピーできませんでした。
km: មិនអាចចម្លងផ្លូវឯកសារបានទេ។
ko: 파일 경로를 복사하지 못했습니다.
nb: Kunne ikke kopiere filbanen.
pl: Nie udało się skopiować ścieżki pliku.
pt_br: Não foi possível copiar o caminho do arquivo.
ru: Не удалось скопировать путь к файлу.
th: คัดลอกเส้นทางไฟล์ไม่ได้
tr: Dosya yolu kopyalanamadı.
uk: Не вдалося скопіювати шлях до файлу.
vi: Không thể sao chép đường dẫn tệp.
zh_hans: 无法复制文件路径。
zh_hant: 無法複製檔案路徑。

# diffViewer.copyFailedGitApplyCommand
source: Could not copy git apply command.
ar: تعذر نسخ أمر git apply.
bs: Nije moguće kopirati naredbu git apply.
da: Kunne ikke kopiere git apply-kommandoen.
de: Der git apply-Befehl konnte nicht kopiert werden.
es: No se pudo copiar el comando git apply.
fr: Impossible de copier la commande git apply.
it: Impossibile copiare il comando git apply.
ja: git apply コマンドをコピーできませんでした。
km: មិនអាចចម្លងពាក្យបញ្ជា git apply បានទេ។
ko: git apply 명령을 복사할 수 없습니다.
nb: Kunne ikke kopiere git apply-kommandoen.
pl: Nie udało się skopiować polecenia git apply.
pt_br: Não foi possível copiar o comando git apply.
ru: Не удалось скопировать команду git apply.
th: ไม่สามารถคัดลอกคำสั่ง git apply ได้
tr: git apply komutu kopyalanamadı.
uk: Не вдалося скопіювати команду git apply.
vi: Không thể sao chép lệnh git apply.
zh_hans: 无法复制 git apply 命令。
zh_hant: 無法複製 git apply 指令。

# diffViewer.copyFilePath
source: Copy path
ar: نسخ المسار
bs: Kopiraj putanju
da: Kopiér sti
de: Pfad kopieren
es: Copiar ruta
fr: Copier le chemin
it: Copia percorso
ja: パスをコピー
km: ចម្លងផ្លូវ
ko: 경로 복사
nb: Kopier bane
pl: Kopiuj ścieżkę
pt_br: Copiar caminho
ru: Скопировать путь
th: คัดลอกพาธ
tr: Yolu kopyala
uk: Скопіювати шлях
vi: Sao chép đường dẫn
zh_hans: 拷贝路径
zh_hant: 拷貝路徑

# diffViewer.copyGitApplyCommand
source: Copy git apply command
ar: نسخ أمر git apply
bs: Kopiraj git apply naredbu
da: Kopiér git apply-kommando
de: Befehl „git apply“ kopieren
es: Copiar comando git apply
fr: Copier la commande git apply
it: Copia comando git apply
ja: git apply コマンドをコピー
km: ចម្លងពាក្យបញ្ជា git apply
ko: git apply 명령어 복사
nb: Kopier git apply-kommando
pl: Kopiuj polecenie git apply
pt_br: Copiar comando git apply
ru: Скопировать команду git apply
th: คัดลอกคำสั่ง git apply
tr: git apply komutunu kopyala
uk: Скопіювати команду git apply
vi: Sao chép lệnh git apply
zh_hans: 复制 git apply 命令
zh_hant: 複製 git apply 指令

# diffViewer.deletions
source: Deletions
ar: الحذوفات
bs: Brisanja
da: Sletninger
de: Löschungen
es: Eliminaciones
fr: Suppressions
it: Eliminazioni
ja: 削除
km: ការលុប
ko: 삭제
nb: Slettinger
pl: Usunięcia
pt_br: Exclusões
ru: Удаления
th: การลบ
tr: Silmeler
uk: Видалення
vi: Dòng xóa
zh_hans: 删除
zh_hant: 刪除

# diffViewer.diffStats
source: Diff stats
ar: إحصائيات الفروقات
bs: Statistika razlika
da: Statistik over forskelle
de: Diff-Statistiken
es: Estadísticas de diferencias
fr: Statistiques de diff
it: Statistiche delle differenze
ja: 差分の統計
km: ស្ថិតិភាពខុសគ្នា
ko: 변경 통계
nb: Statistikk over forskjeller
pl: Statystyki różnic
pt_br: Estatísticas de diferenças
ru: Статистика различий
th: สถิติความแตกต่าง
tr: Fark istatistikleri
uk: Статистика відмінностей
vi: Thống kê diff
zh_hans: 差异统计
zh_hant: 差異統計

# diffViewer.diffTarget
source: Diff target
ar: هدف الفروقات
bs: Cilj poređenja
da: Sammenligningsmål
de: Diff-Ziel
es: Destino de diferencias
fr: Cible du diff
it: Destinazione del confronto
ja: 差分の対象
km: គោលដៅប្រៀបធៀប
ko: 변경 대상
nb: Sammenligningsmål
pl: Cel porównania
pt_br: Destino da comparação
ru: Цель сравнения
th: เป้าหมายการเปรียบเทียบ
tr: Karşılaştırma hedefi
uk: Ціль порівняння
vi: Đích diff
zh_hans: 差异目标
zh_hant: 差異目標

# diffViewer.diffToolbar
source: Diff toolbar
ar: شريط أدوات الفروق
bs: Alatna traka razlika
da: Værktøjslinje for forskelle
de: Diff-Werkzeugleiste
es: Barra de herramientas de diferencias
fr: Barre d’outils des différences
it: Barra degli strumenti delle differenze
ja: 差分ツールバー
km: របារឧបករណ៍ភាពខុសគ្នា
ko: 차이 도구 모음
nb: Verktøylinje for forskjeller
pl: Pasek narzędzi różnic
pt_br: Barra de ferramentas de diferenças
ru: Панель инструментов сравнения
th: แถบเครื่องมือความแตกต่าง
tr: Fark araç çubuğu
uk: Панель інструментів порівняння
vi: Thanh công cụ so sánh
zh_hans: 差异工具栏
zh_hant: 差異工具列

# diffViewer.diffViewer
source: Diff viewer
ar: مستعرض الفروقات
bs: Preglednik razlika
da: Forskelviser
es: Visor de diferencias
fr: Visionneuse de diff
it: Visualizzatore differenze
ja: 差分ビューア
km: កម្មវិធីមើលភាពខុសគ្នា
ko: 변경 사항 뷰어
nb: Forskjellsvisning
pl: Przeglądarka różnic
pt_br: Visualizador de diferenças
ru: Просмотр различий
th: ตัวแสดงความแตกต่าง
tr: Fark görüntüleyici
uk: Перегляд відмінностей
vi: Trình xem diff
zh_hans: 差异查看器
zh_hant: 差異檢視器

# diffViewer.disableWordDiffs
source: Disable word diffs
ar: تعطيل الفروقات على مستوى الكلمات
bs: Isključi razlike po riječima
da: Deaktivér ordforskelle
de: Wort-Diffs deaktivieren
es: Desactivar diferencias de palabras
fr: Désactiver les diffs par mot
it: Disattiva differenze per parola
ja: 単語単位の差分をオフ
km: បិទភាពខុសគ្នាតាមពាក្យ
ko: 단어 단위 변경 해제
nb: Deaktiver ordforskjeller
pl: Wyłącz różnice słów
pt_br: Desativar diferenças por palavra
ru: Отключить различия по словам
th: ปิดความแตกต่างระดับคำ
tr: Sözcük farklarını kapat
uk: Вимкнути відмінності за словами
vi: Tắt word diff
zh_hans: 禁用词级差异
zh_hant: 停用單字差異

# diffViewer.disableWordWrap
source: Disable word wrap
ar: تعطيل التفاف الكلمات
bs: Isključi prelamanje riječi
da: Slå ordombrydning fra
de: Zeilenumbruch deaktivieren
es: Desactivar ajuste de línea
fr: Désactiver le retour à la ligne automatique
it: Disattiva a capo automatico
ja: 折り返しをオフ
km: បិទការបង្វិលពាក្យ
ko: 자동 줄 바꿈 해제
nb: Slå av tekstbryting
pl: Wyłącz zawijanie wierszy
pt_br: Desativar quebra de linha
ru: Отключить перенос строк
th: ปิดการตัดคำ
tr: Sözcük kaydırmayı kapat
uk: Вимкнути перенесення рядків
vi: Tắt word wrap
zh_hans: 禁用自动换行
zh_hant: 停用自動換行

# diffViewer.enableWordDiffs
source: Enable word diffs
ar: تمكين الفروقات على مستوى الكلمات
bs: Uključi razlike po riječima
da: Aktivér ordforskelle
de: Wort-Diffs aktivieren
es: Activar diferencias de palabras
fr: Activer les diffs par mot
it: Attiva differenze per parola
ja: 単語単位の差分をオン
km: បើកភាពខុសគ្នាតាមពាក្យ
ko: 단어 단위 변경 설정
nb: Aktiver ordforskjeller
pl: Włącz różnice słów
pt_br: Ativar diferenças por palavra
ru: Включить различия по словам
th: เปิดความแตกต่างระดับคำ
tr: Sözcük farklarını aç
uk: Увімкнути відмінності за словами
vi: Bật word diff
zh_hans: 启用词级差异
zh_hant: 啟用單字差異

# diffViewer.enableWordWrap
source: Enable word wrap
ar: تمكين التفاف الكلمات
bs: Uključi prelamanje riječi
da: Aktivér ordombrydning
de: Zeilenumbruch aktivieren
es: Activar ajuste de línea
fr: Activer le retour à la ligne automatique
it: Attiva a capo automatico
ja: 折り返しをオン
km: បើកការបង្វិលពាក្យ
ko: 자동 줄 바꿈 설정
nb: Aktiver tekstbryting
pl: Włącz zawijanie wierszy
pt_br: Ativar quebra de linha
ru: Включить перенос строк
th: เปิดการตัดคำ
tr: Sözcük kaydırmayı aç
uk: Увімкнути перенесення рядків
vi: Bật word wrap
zh_hans: 启用自动换行
zh_hant: 啟用自動換行

# diffViewer.expandAllDiffs
source: Expand all diffs
ar: توسيع جميع الفروقات
bs: Proširi sve diffove
da: Udvid alle diffs
de: Alle Diffs erweitern
es: Expandir todas las diferencias
fr: Développer tous les diffs
it: Espandi tutti i diff
ja: すべての差分を展開
km: ពង្រីក diff ទាំងអស់
ko: 모든 변경 사항 펼치기
nb: Utvid alle diffs
pl: Rozwiń wszystkie diffy
pt_br: Expandir todos os diffs
ru: Развернуть все diff
th: ขยาย diff ทั้งหมด
tr: Tüm diff’leri genişlet
uk: Розгорнути всі diff
vi: Mở rộng tất cả diff
zh_hans: 展开所有差异
zh_hant: 展開所有差異
